
&Вместо("ПоказатьНерекомендуемуюВерсиюПлатформы")
Функция itra_ПоказатьНерекомендуемуюВерсиюПлатформы(Параметры)
	// bkpuser - служебный пользователь для автоматизации, ему не показываем окно рекомендуюемой платформы
	Если ИмяПользователя() = "bkpuser" ИЛИ ИмяПользователя() = "Администратор (ОрловАВ)" Тогда
		СистемнаяИнформация = Новый СистемнаяИнформация;
		Текущая       = СистемнаяИнформация.ВерсияПриложения;
		Минимальная   = Параметры.МинимальнаяВерсияПлатформы;
		Рекомендуемая = Параметры.РекомендуемаяВерсияПлатформы;
		
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Рекомендуемая, Текущая) > 0
			И ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Текущая, Минимальная) >= 0 Тогда
			ЗаписьЖурналаРегистрации("it_Админ", УровеньЖурналаРегистрации.Информация, , , "отключил показ не рекомендуемой версии");
			Возврат Ложь;
		КонецЕсли;		
	КонецЕсли;
	
	Результат = ПродолжитьВызов(Параметры);
	Возврат Результат;
КонецФункции
